Repository: fedepo/phone.id-iOS-SDK
Catalog: Pod/Assets/strings/*.lproj/Localizable.strings
Languages: it

# html-button.title.login.with.phone.id
source: <center style="color:$buttonTextColor; font-family: Helvetica Neue; font-size:18px;">Login with phone.id</center>
it: <center style="color:$buttonTextColor; font-family: Helvetica Neue; font-size:18px;">Login con phone.id</center>

# button.title.done.keyboard
source: Done
it: Fatto

# button.title.change.country.code
source: Change Country
it: Cambia Paese

# accessibility.button.title.change.country.code
source: Change Country
it: Cambia Paese

# accessibility.button.title.done.keyboard
source: Done
it: Fatto

# accessibility.title.login.with.phone.id
source: Login with phone.id
it: Login con phone.id

# accessibility.phone.number.input
source: Phone Number
it: Numero di telefono

# accessibility.verification.input
source: Verification Code
it: Codice di verifica

# html-button.title.logout
source: <center style="color:$buttonTextColor; font-family: Helvetica Neue; font-size:18px;">Log out</center>
it: <center style="color:$buttonTextColor; font-family: Helvetica Neue; font-size:18px;">Uscire</center>

# accessibility.button.title.logout
source: Log out
it: Uscire

# html-access.app.with.number
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:18px;">Access <b style="color:$selectedText">%@</b><br/>with your phone number:</center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:18px;">Accesso <b style="color:$selectedText">%@</b><br/>con il tuo numero di telefono:</center>

# accessibility.button.title.close
source: Close
it: Chiudere

# accessibility.button.title.back
source: Back
it: Indietro

# html-your.number.is.safe
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:14px;">Your number is safe:<br/>we don't share it, we don't SPAM you.</center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:15px;">Il tuo numero è sicuro:<br/> non condividiamo, non spam.</center>

# html-label.terms.and.conditions
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:15px;">By continuing, you agree with:<br/><a href="%@">Terms & Conditions</a> and <a href="%@">Privacy Policy</a></center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:15px;">Continuando, sei d'accordo con:<br/><a href="%@">Condizioni</a> e <a href="%@">Informativa sulla Privacy</a></center>

# html-title.country.code
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:17px;">Country Code</center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:17px;">Prefisso Internazionale</center>

source: Current Phone
it: Telefono corrente

# html-type.the.confirmation.code
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:18px;">Type the confirmation code</br>we just texted you:</center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:18px;">Digita il codice di conferma</b>che abbiamo appena si texted:</center>

# html-logging.in
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:16px;">Logging in...</center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:16px;">Entrando ...</center>

# html-logged.in
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:16px;">Logged in with phone.id</center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:16px;">Collegato con phone.id</center>

# html-loggin.failed
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:16px;">The code you typed is different<br/> from the one we've sent you.<br/><br/>Correct the code, or press back and<br/>check your phone number.</center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:16px;">Il codice digitato è diverso<br/> da quello che abbiamo trasmesso voi.<br/><br/>Correggere il codice, oppure premere indietro e controllare il vostro numero di telefono.</center>

# profile.name.placeholder
source: Name (and Surname)
it: Nome (e Cognome)

# profile.birthday.placeholder
source: Date of Birth
it: Data di nascita

# alert.button.title.dismiss
source: Dismiss
it: Respingere

# alert.title.error
source: Error
it: Errore

# phone.id.needs.access.to.your.contacts
source: Failed to upload contacts. Please allow phone.id to access ypur contacts in the Settings App
it: Impossibile caricare contatti. Si prega di consentire di accedere ypur phone.id contatti in App Impostazioni

# html-button.title.change.picture
source: <center style="color:$mainAccent; font-family: Helvetica Neue; font-size:18px;">CHANGE PICTURE</center>
it: <center style="color:$mainAccent; font-family: Helvetica Neue; font-size:18px;">CAMBIA IMMAGINE</center>

# html-button.title.edit.profile
source: <center style="color:$mainAccent; font-family: Helvetica Neue; font-size:18px;">EDIT INFO</center>
it: <center style="font-weight: bold; color:$normalText; font-family: Helvetica Neue; font-size:18px;">Modifica</center>

# html-button.title.save.profile
source: <center style="color:$mainAccent; font-family: Helvetica Neue; font-size:18px;">SAVE</center>
it: <center style="font-weight: bold; color:$normalText; font-family: Helvetica Neue; font-size:18px;">Salva</center>

# html-title.public.profile
source: <center style="color:$normalText; font-family: Helvetica Neue; font-size:17px;">Public Profile</center>
it: <center style="color:$normalText; font-family: Helvetica Neue; font-size:17px;">Profilo pubblico</center>

# alert.title.select.image
source: Pick an image from
it: Scegli un'immagine da

# alert.button.title.camera
source: Camera
it: fotocamera

# alert.button.title.library
source: Library
it: libreria

# error.failed.request.auth.code
source: Failed to request PhoneId authentication code
it: Impossibile richiedere codice di autenticazione PhoneId.

# error.failed.request.clients
source: Failed to request list of clients
it: Impossibile alla lista delle richieste dei clienti.

# error.unexpected.response
source: Failed to parse server response.
it: Impossibile analizzare la risposta del server.

# error.reason.auth.unexpected.response
source: Success key not found in response
it: Chiave Il successo non trovata in risposta.

# error.reason.clients.unexpected.response
source: There is no "appName" key in response
it: Non esiste una chiave "appName" in risposta.

# error.phone.number.validation.failed
source: Phone Number validation failed.
it: Convalida numero di telefono non è riuscita.

# error.unkonwn.problem.phone.number.validation
source: Unknown phone number validation error.
it: Telefono Errore sconosciuto convalida numero.

# error.failed.request.user.info
source: Failed to request PhoneId user info.
it: Impossibile chiedere PhoneId informazioni utente.

# error.user.info.unexpected.response
source: Failed to parse user info.
it: Impossibile analizzare informazioni utente.

# error.reason.user.info.unexpected.response
source: User info keys [id, client_id, phoneNumber] not found in response.
it: Chiavi informazioni utente [id, client_id, phoneNumber] non trovato in risposta.

# error.failed.request.code.verification
source: Code verification request has failed.
it: Richiesta di verifica di codice non è riuscita.

# error.reason.response.does.not.contain.valid.token.info
source: Response does not contain valid token info.
it: Response does not contain valid token.

# error.failed.refresh.token
source: Failed to refresh authentication.
it: Impossibile aggiornare l'autenticazione.

# error.reason.no.token.to.refresh
source: There is no authentication credentials to refresh them.
it: Non ci sono le credenziali di autenticazione per rinfrescare loro.

# error.failed.to.upload.contacts
source: Failed to upload contacts
it: Impossibile caricare contatti.
